In [1]:
import numpy as np
import pandas as pd

In [3]:
dict={'First Score':[100,90,np.nan,95],
       'Second Score':[30,45,56,np.nan],
        'Third Score':[np.nan,40,80,98]}
df=pd.DataFrame(dict)
print(df)

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [7]:
#find the nan values from this dataframe
df.isna()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [9]:
# find the nan values by using the null()
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [11]:
# find the number of nan values 
df.isna().sum()

First Score     1
Second Score    1
Third Score     1
dtype: int64

In [13]:
# find the number of nan values 
df.isnull().sum()

First Score     1
Second Score    1
Third Score     1
dtype: int64

In [17]:
# finding the not nan values
df.notna()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

In [19]:
df.notnull()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

In [21]:
# finding the number of notnull values 
df.notna().sum()

First Score     3
Second Score    3
Third Score     3
dtype: int64

In [23]:
df.notnull().sum()

First Score     3
Second Score    3
Third Score     3
dtype: int64

In [25]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [27]:
# find the nan values in the firstscore
df["First Score"].isna()

0    False
1    False
2     True
3    False
Name: First Score, dtype: bool

In [29]:
df["First Score"].isna().sum()

1

In [31]:
# fill the values to the null values 
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [37]:
df=df.fillna(0)

In [39]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [41]:
# second example on datafram 
# create the dataframe

In [43]:
df=pd.DataFrame(({"Courses":["spark","java","scala","python"],
                  "Fee":[20000,np.nan,26000,24000],
                  "Duration":["30 Days","40 Days",pd.NA,"40 Days"],
                  "Discount":[1000,np.nan,2500,None]}))
print(df)

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       NaN
2   scala  26000.0     <NA>    2500.0
3  python  24000.0  40 Days       NaN

In [45]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       NaN
2   scala  26000.0     <NA>    2500.0
3  python  24000.0  40 Days       NaN

In [47]:
# fill the all nan values with none
df.fillna("None")

  Courses      Fee Duration Discount
0   spark  20000.0  30 Days   1000.0
1    java     None  40 Days     None
2   scala  26000.0     None   2500.0
3  python  24000.0  40 Days     None

In [51]:
# fill the discount column with 0
df["Discount"]

0    1000.0
1       NaN
2    2500.0
3       NaN
Name: Discount, dtype: float64

In [57]:
df2=df["Discount"].fillna(0)

In [59]:
df2

0    1000.0
1       0.0
2    2500.0
3       0.0
Name: Discount, dtype: float64

In [61]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       NaN
2   scala  26000.0     <NA>    2500.0
3  python  24000.0  40 Days       NaN

In [63]:
# fill the values with o multiple columns

In [65]:
df[["Fee","Duration"]]

       Fee Duration
0  20000.0  30 Days
1      NaN  40 Days
2  26000.0     <NA>
3  24000.0  40 Days

In [67]:
df[["Fee","Duration"]]=df[["Fee","Duration"]].fillna(value=({"Fee":22000,"Duration":"35 Days"}))

In [69]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java  22000.0  40 Days       NaN
2   scala  26000.0  35 Days    2500.0
3  python  24000.0  40 Days       NaN

In [71]:
df["Discount"]=df["Discount"].fillna(value={"Discount":[1200,1400]})

C:\Users\dell\AppData\Local\Temp\ipykernel_2748\1741206231.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["Discount"]=df["Discount"].fillna(value={"Discount":[1200,1400]})

In [73]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java  22000.0  40 Days       NaN
2   scala  26000.0  35 Days    2500.0
3  python  24000.0  40 Days       NaN

In [83]:
df["Discount"]=df["Discount"].fillna(1200)

In [85]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java  22000.0  40 Days    1200.0
2   scala  26000.0  35 Days    2500.0
3  python  24000.0  40 Days    1200.0

In [87]:
df=pd.DataFrame(({"Courses":["spark","java","scala","python"],
                  "Fee":[20000,np.nan,26000,24000],
                  "Duration":["30 Days","40 Days",pd.NA,"40 Days"],
                  "Discount":[1000,np.nan,2500,None]}))
print(df)

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       NaN
2   scala  26000.0     <NA>    2500.0
3  python  24000.0  40 Days       NaN

In [89]:
df["Discount"]

0    1000.0
1       NaN
2    2500.0
3       NaN
Name: Discount, dtype: float64

In [91]:
df["Discount"].isna()

0    False
1     True
2    False
3     True
Name: Discount, dtype: bool

In [93]:
df.loc[df["Discount"].isna()]

  Courses      Fee Duration  Discount
1    java      NaN  40 Days       NaN
3  python  24000.0  40 Days       NaN

In [99]:
df=pd.DataFrame(({"Courses":["spark","java","scala","python"],
                  "Fee":[20000,np.nan,26000,24000],
                  "Duration":["30 Days","40 Days",pd.NA,"40 Days"],
                  "Discount":[1000,np.nan,2500,None]}))
print(df)

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       NaN
2   scala  26000.0     <NA>    2500.0
3  python  24000.0  40 Days       NaN

In [101]:
df.loc[df["Discount"].isna()]

  Courses      Fee Duration  Discount
1    java      NaN  40 Days       NaN
3  python  24000.0  40 Days       NaN

In [103]:
df.loc[df["Discount"].isna(),["Discount"]]=0

In [105]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       0.0
2   scala  26000.0     <NA>    2500.0
3  python  24000.0  40 Days       0.0

In [109]:
df.iloc[2:3]

  Courses      Fee Duration  Discount
2   scala  26000.0     <NA>    2500.0

In [115]:
df.iloc[2:3,2]

2    <NA>
Name: Duration, dtype: object

In [117]:
df.iloc[2:3,2]="25 Days"

In [119]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       0.0
2   scala  26000.0  25 Days    2500.0
3  python  24000.0  40 Days       0.0

In [121]:
df.loc[1]

Courses        java
Fee             NaN
Duration    40 Days
Discount        0.0
Name: 1, dtype: object

In [123]:
df.loc[1,"Fee"]

nan

In [125]:
df.loc[1,"Fee"]=22000

In [127]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java  22000.0  40 Days       0.0
2   scala  26000.0  25 Days    2500.0
3  python  24000.0  40 Days       0.0

In [129]:
df.iloc[1:2]

  Courses      Fee Duration  Discount
1    java  22000.0  40 Days       0.0

In [131]:
df.iloc[1:2,3]

1    0.0
Name: Discount, dtype: float64

In [133]:
df.iloc[1:2,3]=1200

In [135]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java  22000.0  40 Days    1200.0
2   scala  26000.0  25 Days    2500.0
3  python  24000.0  40 Days       0.0

In [137]:
df.loc[3]

Courses      python
Fee         24000.0
Duration    40 Days
Discount        0.0
Name: 3, dtype: object

In [139]:
df.loc[3,"Discount"]

0.0

In [141]:
df.loc[3,"Discount"]=1400

In [143]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java  22000.0  40 Days    1200.0
2   scala  26000.0  25 Days    2500.0
3  python  24000.0  40 Days    1400.0

In [145]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java  22000.0  40 Days    1200.0
2   scala  26000.0  25 Days    2500.0
3  python  24000.0  40 Days    1400.0

In [147]:
df=pd.DataFrame(({"Courses":["spark","java","scala","python"],
                  "Fee":[20000,np.nan,26000,24000],
                  "Duration":["30 Days","40 Days",pd.NA,"40 Days"],
                  "Discount":[1000,np.nan,2500,None]}))
print(df)

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       NaN
2   scala  26000.0     <NA>    2500.0
3  python  24000.0  40 Days       NaN

In [149]:
# droping the vaues from the dataframe

In [153]:
# syntax:DataFrameobj.dropna(axis,how)
# default value of axis is 0
# default value of the how is "any"

In [155]:
df.dropna()

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0

In [157]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       NaN
2   scala  26000.0     <NA>    2500.0
3  python  24000.0  40 Days       NaN

In [159]:
df.dropna(axis=1,how="any")

  Courses
0   spark
1    java
2   scala
3  python

In [163]:
df.dropna(axis=0,how="any")

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0

In [165]:
df

  Courses      Fee Duration  Discount
0   spark  20000.0  30 Days    1000.0
1    java      NaN  40 Days       NaN
2   scala  26000.0     <NA>    2500.0
3  python  24000.0  40 Days       NaN